Catalogs/МаршрутыДвиженияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>МаршрутыДвиженияЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРеализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Д_ИсточникиСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдачаВПодОтчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОФК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Д_ТипыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвтомаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаршрутЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СубъектСогласования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:EnumRef.ОсновныеДолжностиПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.Д_Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНаВыполнение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязателен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МожетРедактировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутИсполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:EnumRef.ОсновныеДолжностиПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.Д_Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбязательныйКПрикреплению</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутОзнакомления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:EnumRef.ОсновныеДолжностиПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.Д_Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредприятияПодразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатьиДДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопУсловия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИУДСтрокиВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МаршрутыДвиженияЗаявок/Forms/ФормаДопУсловий/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	
	УсловияВладельца = ВладелецФормы.ДопУсловия;
	
	КоличествоТекУсловий = УсловияВладельца.Количество();
	
	Для Сч = 1 По КоличествоТекУсловий Цикл
		Если УсловияВладельца[КоличествоТекУсловий - Сч].ИдСтроки = ИД Тогда
			УсловияВладельца.Удалить(КоличествоТекУсловий - Сч);
		КонецЕсли;
	КонецЦикла;	
		
	Для Каждого СтрокаУсловий Из ДопУсловия Цикл
		ЗаполнитьЗначенияСвойств(ВладелецФормы.ДопУсловия.Добавить(), СтрокаУсловий);
	КонецЦикла;
	
	Оповестить("ОбновитьНадписиДопУсловий");
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИД") Тогда
		ИД = Параметры.ИД;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДопУсловияРеквизитПриИзменении(Элемент)
	
	УстановитьТип();
			
КонецПроцедуры

&НаКлиенте
Процедура ДопУсловияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.ДопУсловия.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.ИДСтроки) Тогда
			ТекДанные.ИДСтроки = ИД;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УсловияВладельца = ВладелецФормы.ДопУсловия;
	
	НайденныеСтроки = УсловияВладельца.НайтиСтроки(Новый Структура("ИДСтроки", ИД));
	Для Каждого СтрокаУсловий Из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(ДопУсловия.Добавить(), СтрокаУсловий);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопУсловияПриАктивизацииСтроки(Элемент)
	
	УстановитьТип();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТип()
	
	ТекДанныеСтроки = Элементы.ДопУсловия.ТекущиеДанные;
	Если ТекДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Элементы.ДопУсловияЗначение.РежимВыбораИзСписка = Ложь;
	
	Массив = Новый Массив;
	Если ТекДанныеСтроки.Реквизит = "Сумма документа"  Или ТекДанныеСтроки.Реквизит = "Скидка (ДДУ)" Тогда
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(15,2);
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = 0;		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "Источник" Тогда
		Массив.Добавить(Тип("СправочникСсылка.Кассы"));
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "ИнвПроект" Тогда
		Массив.Добавить(Тип("СправочникСсылка.ОбъектыСтроительства"));
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = ПредопределенноеЗначение("Справочник.ОбъектыСтроительства.ПустаяСсылка");		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "Автор" Тогда
		Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "АвтоДоставка" Или ТекДанныеСтроки.Реквизит = "ЖДДоставкаДоки" Или ТекДанныеСтроки.Реквизит = "АвтоДоставкаДоки" Тогда
		Массив.Добавить(Тип("Булево"));
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = Ложь;		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "ТипРеализации" Тогда
		Массив.Добавить(Тип("Строка"));
		КС = Новый КвалификаторыСтроки(20);
		Элементы.ДопУсловияЗначение.РежимВыбораИзСписка = Истина;
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Спирт№1");
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Спирт№2");
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Спирт№2ПодДоки");
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Доки");
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("ПрочаяПродукция");
	ИначеЕсли ТекДанныеСтроки.Реквизит = "ВидМероприятия" Тогда
		Массив.Добавить(Тип("Строка"));
		КС = Новый КвалификаторыСтроки(20);
		Элементы.ДопУсловияЗначение.РежимВыбораИзСписка = Истина;
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Скидка");
	КонецЕсли;
	Описание = Новый ОписаниеТипов(Массив,,,КЧ,КС);
	ТекДанныеСтроки.ТипЗначенияРеквизита = Описание;
	
	Элементы.ДопУсловияЗначение.ОграничениеТипа = ТекДанныеСтроки.ТипЗначенияРеквизита;	
	
КонецПроцедуры
